am/OpenFOAM-10/tutorials/combustion/buoyantReactingFoam/Lagrangian/splashPanel/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.23;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    region0_to_wallFilm_walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
